{"doc":{"id":"1GWeaPDXO8mlTf9EouKb8G","name":"dq_av_match_code_descriptions_infa","description":"Contains alphanumeric status values that indicate the outcome of the verification operation for an address. Each status value has a corresponding text description.","documentType":"DICTIONARY","repoInfo":{"repoPath":"","repoHandle":"1GWeaPDXO8mlTf9EouKb8G"},"docRef":null,"customAttributes":{"stringAttrs":[{"name":"ReferencedPublishingAllowed","value":"true"}]},"nativeData":{"id":"1GWeaPDXO8mlTf9EouKb8G","documentBlob":"{\"name\":\"\",\"defaultValueLiteral\":\"\",\"description\":\"\",\"readRelationalDSO\":{\"relationalFields\":[{\"name\":\"Column 1\",\"odbcPrecision\":512,\"label\":\"Column 1\"},{\"name\":\"Column 2\",\"odbcPrecision\":512,\"label\":\"Column 2\"}]},\"tags\": []}"},"documentState":null},"data":"{\"cols\":[\"unique_row_identifier\",\"Column 1\",\"Column 2\"],\"rows\":[[50,\"Verified. The input data is correct. Address validation checked all postally relevant elements and inputs matched perfectly\",\"V4\"],[51,\"Verified - Input data correct on input but some or all elements were standardised or input contains outdated names or exonyms\",\"V3\"],[52,\"Verified. The input data is correct but some elements cannot be verified because of incomplete reference data.\",\"V2\"],[53,\"Verified. The input data is correct but the user standardization has negatively impacted deliverability.For example the postcode length is to short.\",\"V1\"],[54,\"Corrected - all elements have been checked\",\"C4\"],[55,\"Corrected. Some elements cannot be checked.\",\"C3\"],[56,\"Corrected but the delivery status is unclear due to absent reference data.\",\"C2\"],[57,\"Corrected but the delivery status is unclear because user standardization introduced errors.\",\"C1\"],[58,\"Data cannot be corrected completely but there is a single match with an address in the reference data.\",\"I4\"],[59,\"Data cannot be corrected completely and there are multiple matches with addresses in the reference data.\",\"I3\"],[60,\"Data cannot be corrected. Batch mode returns partial suggested addresses.\",\"I2\"],[61,\"Data cannot be corrected. Batch mode cannot suggest an address.\",\"I1\"],[62,\"Suggestion List mode. Address validation can suggest one or more complete addresses.\",\"Q3\"],[63,\"Suggestion List mode. The suggested address is complete but includes elements copied from the input address.\",\"Q2\"],[64,\"Suggestion List mode. Address validation cannot suggest a complete address. The address needs more input data.\",\"Q1\"],[65,\"Suggestion List mode. There is insufficient input data to generate suggestions.\",\"Q0\"],[66,\"Country recognized from the Force Country setting in the transformation.\",\"RA\"],[67,\"Country recognized from the Default Country setting in the transformation.\",\"R9\"],[68,\"Country recognized from other elements in the address data.\",\"R8\"],[69,\"Country recognized from name with errors\",\"R7\"],[70,\"Country recognized from territory\",\"R6\"],[71,\"Country recognized from province\",\"R5\"],[72,\"Country recognized from major town\",\"R4\"],[73,\"Country recognized from format\",\"R3\"],[74,\"Country recognized from script\",\"R2\"],[75,\"Country not recognized - multiple matches\",\"R1\"],[76,\"Country not recognized\",\"R0\"],[77,\"Parse mode. The address was parsed perfectly.\",\"S4\"],[78,\"Parse mode. The address was parsed with multiple results.\",\"S3\"],[79,\"Parsed with Errors - Elements change position\",\"S2\"],[80,\"Parse mode. There was a parsing error due to an input format mismatch.\",\"S1\"],[81,\"Validation error. Validation did not take place because the country is not recognized or not supported.\",\"N1\"],[82,\"Validation error. Validation did not take place because the required reference database is not available.\",\"N2\"],[83,\"Validation error. Validation did not take place because the country data cannot be unlocked.\",\"N3\"],[84,\"Validation error. Validation did not take place because the reference data is corrupt or badly formatted.\",\"N4\"],[85,\"Validation error. Validation did not take place because the reference database is out of date.\",\"N5\"],[86,\"Validation Error: No validation performed because input data was insufficient\",\"N6\"],[87,\"Country recognized from abbreviation. Recognizes ISO two-character and ISO three-character country codes. Can recognize common abbreviations such as \",\"RB\"],[88,\"No information found for the address code\",\"A0\"],[89,\"Either partial or complete address found for the address code\",\"A1\"]]}"}